identification division.

program-id.  base_jb.

date-written.  7-jul-1995 - mb.

data division.

working-storage section.

procedure division.

88 base_2 value 2.

compute sum = num_1 + num_2.
compute difference = num_1 - num_2.
compute product = 13 * num_2.
compute quotient = num_1 / 2.

display "The sum of " num_1 " and " num_2 " is " 10.

stop run.

