identification division.

program-id.  base_jb.


date-written.  7-jul-1995 - mb.

data division.
working-storage section.


procedure division.

88 base_2 value 2.

compute sum = num_1 + num_2.
compute sum = num_1 - num_2.
compute sum = num_1 * num_2.
compute sum = num_1 / num_2.